{
  "posts": [
    {
      "id": "work-life-balance-as-a-mother",
      "title": "Navigating Work-Life Balance as a Mother: A Candid Look",
      "date": "2025-02-03",
      "category": "Work/Life Balance",
      "excerpt": "Becoming a mother reshapes your life in ways you can’t anticipate, and the idea of work-life balance often feels unattainable. While Germany offers some parental benefits, the reality is that many mothers still face immense challenges — from sleep deprivation and career sacrifices to a lack of systemic support. The shift to nuclear families has made parenting even more isolating, leaving many to juggle work and childcare alone.\n\nSolutions like onsite childcare, flexible work policies, and stronger state support could transform the landscape for working parents. But beyond policy changes, a societal shift is needed — children aren’t just a personal choice; they’re the future. It’s time we start treating them as such.",
      "image": "/content/blog/images/mother.jpg"
    },
    {
      "id": "webseite-development",
      "title": "How This Website Was Created: A Journey of AI, Code, and Creativity",
      "date": "2025-02-04",
      "category": "AI",
      "excerpt": "Building a website from scratch using React — with no prior experience was an ambitious challenge. Instead of relying on a traditional website builder, I teamed up with an AI assistant, Claude, to turn my vision into reality. The journey started smoothly, with AI generating clean code and styling, but I quickly ran into roadblocks: outdated npm suggestions, creative limitations, and AI’s struggles with project-wide context.\n\nThat’s when I discovered Windsurf — a more intuitive AI tool that streamlined my workflow with smart code cleanup and context-aware suggestions. Despite its quirks, Windsurf helped bridge the gap between AI assistance and human decision-making. This experience reinforced a key lesson: AI isn’t replacing developers yet, but it’s transforming how we create, learn, and build.",
      "image": "/content/blog/images/AI assistant chatbot.jpg"
    },
    {
      "id": "go-to-market-strategy",
      "title": "Cracking the Code: How to Nail Your Startup’s Go-To-Market Strategy",
      "date": "2025-02-04",
      "category": "Business",
      "excerpt": "Bringing a new product to market is no small feat. In [episode #5](https://www.youtube.com/watch?v=sVoLfBpJ7Po) of our podcast [Startup Sl*ts](https://www.youtube.com/@Startupslts), we sat down with Anna, a seasoned expert in go-to-market (GTM) strategies, to uncover the secrets of a successful product launch. From distinguishing GTM from traditional marketing to crafting compelling messaging and setting the right pricing, Anna shares practical insights every startup needs. She also dives into real-world examples, like how a French dating site used a bold offline campaign to capture attention. Whether you're launching a new venture or refining your approach, this guide will help you navigate the journey from idea to market success.",      
      "image": "/content/blog/images/GTM.jpg"
    }
  ]
}
